edc/bass
fisherman/fzf
joseluisq/gitnow
laughedelic/brew-completions
b4b4r07/enhancd
jorgebucaran/nvm.fish
jorgebucaran/bax.fish
reitzig/sdkman-for-fish@v1.4.0
