cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Security
cask "avast-security"
cask "1password"
cask "1password-cli"

# Everything VM related
cask "docker"

# Web browsers
cask "google-chrome"

# Core development
cask "iterm2"
cask "kaleidoscope"

# IDEs
cask "webstorm"
cask "intellij-idea"
cask "visual-studio-code"

# File/directory management
cask "osxfuse"
brew "ext4fuse"
cask "transmit4"

# Networking
cask "ngrok"

# Mac OS management
cask "setapp" # Install favorite apps installing 'setapp'
cask "haptic-touch-bar" # if you have touch bar
cask "switchresx"
cask "appcleaner"
cask "muzzle"
cask "browserosaurus"
cask "alfred"

# Media players
cask "iina"

# Backups
cask "imazing"

# Office
cask "microsoft-office"
cask "pdf-expert"

# Install developer friendly quick look plugins
# see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font-mono"

# Misc.
cask "rocket"
