cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Security
cask "1password"
cask "1password-cli"
cask "nordvpn"

# Everything VM related
cask "docker"
cask "parallels"

# Web browsers
cask "google-chrome"

# Core development
cask "iterm2"
cask "warp"
cask "kaleidoscope"
cask "ksdiff"
cask "fig"

# IDEs

# Jetbrains
cask "webstorm"
cask "intellij-idea"
cask "jetbrains-toolbox"

cask "visual-studio-code"

# File/directory management
# cask "osxfuse" # not compatible with Mac OS Monterey
# brew "ext4fuse"

# Cloud Drive
cask "insync"

# Networking
cask "ngrok"

# Mac OS management
cask "setapp" # Install favorite apps installing 'setapp'
cask "latest"
cask "appcleaner"
cask "muzzle"
cask "browserosaurus"
cask "raycast"
cask "betterdisplay"
cask "monitorcontrol"
cask "contexts"

# Media players
cask "iina"

# Backups
cask "imazing"

# Design
cask "figma"

# Office
cask "microsoft-office"
cask "pdf-expert"
cask "grammarly"

# Install developer friendly quick look plugins
# see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Misc.
cask "rocket"
