tap "bramstein/webfonttools"
tap "github/gh"
tap "jkfran/killport"

# Mac OS management
brew "m-cli"
brew "dark-mode"
brew "wallpaper"

# Image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick"

# VCS related
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "ksdiff"
brew "hub"
brew "gitsh"
brew "tig"
brew "github/gh/gh"
brew "jesseduffield/lazygit/lazygit"
brew "lazygit"

# File/directory management
brew "fzf"
brew "fzy"
brew "z"
brew "bat"

# Compression utilities
brew "p7zip"
brew "pigz"
brew "xz"

# Terminal multiplexing
brew "tmux"
brew "reattach-to-user-namespace"

# Install other useful binaries.
brew "thefuck"
brew "starship"

# podman
brew "podman"
brew "podman-desktop"
brew "podman-compose"
brew "kind"

# docker
brew "docker"
brew "docker-slim"
brew "lazydocker"

# Misc.
brew "shellcheck"
brew "killport"
brew "multipass"
