tap "bramstein/webfonttools"
tap "github/gh"

# Mac OS management
brew "m-cli"
brew "dark-mode"
brew "wallpaper"

# Image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick"

# VCS related
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "hub"
brew "gitsh"
brew "tig"
brew "github/gh/gh"

# File/directory management
brew "fzf"
brew "fzy"
brew "z"
brew "bat"

# Compression utilities
brew "p7zip"
brew "pigz"
brew "unrar"
brew "xz"

# Everything VM related
brew "docker"

# Terminal multiplexing
brew "tmux"
brew "reattach-to-user-namespace"

# Install other useful binaries.
brew "thefuck"
brew "starship"
